---
kind: property
id: P:Autodesk.Revit.DB.Macros.ModuleSettings.Name
source: html/87e9a80c-7e7d-4087-035d-dd993abee73c.htm
---
# Autodesk.Revit.DB.Macros.ModuleSettings.Name Property

The module name.

## Syntax (C#)
```csharp
public string Name { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null